# 1.Read the housingdata.csv file into pandas DataFrame and display first six rows of the Dataframe

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("C:/Users/ASUS/Downloads/housingdata (1).csv")

In [3]:
df.head(6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

# 2.Display the column names and row index in separate cells.

In [4]:
# Display column names
column_names = df.columns
column_names

# Display row index
row_index = df.index
row_index

RangeIndex(start=0, stop=9, step=1)

# 3.a) How many numbers of “STATE” exist in the dataset. Hint: use shape
#   b) How many unique states exist in the dataset

In [5]:
# a) Number of "STATE" entries in the dataset
num_state_entries = df.shape[0]

# b) Number of unique states in the dataset
num_unique_states = df["STATE"].nunique()

num_state_entries, num_unique_states

(9, 6)

# 4.Retrieve the list of all NaN/Null/Empty cells in the form of Boolean list

In [6]:
# Create a Boolean DataFrame where True represents NaN/Null/Empty cells
null_cells = df.isnull()

# Display the Boolean DataFrame
print(null_cells)

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False  False
2  False  False  False          True     False  False
3  False  False  False         False      True  False
4   True  False  False         False     False  False
5  False  False  False          True     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False   True
8  False  False  False         False     False  False

# 5.Drop all rows with N/A,NA,na values in Num_Bedrooms

In [7]:
# Drop rows with N/A, NA, na values in the "Num_Bedrooms" column
df = df.dropna(subset=["NUM_BEDROOMS"], how="any")

# After dropping rows, you may want to reset the index
df.reset_index(drop=True, inplace=True)

# 6.Replace the NaN and String entries in Num_Bath with previous entry

In [8]:
# Replace NaN and string entries in "Num_Bath" with the previous entry
df['NUM_BATH'] = df['NUM_BATH'].fillna(method='ffill')

C:\Users\ASUS\AppData\Local\Temp\ipykernel_18860\494453396.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['NUM_BATH'] = df['NUM_BATH'].fillna(method='ffill')

# 7.Replace the empty values in “SQ_FT” with the mean of the all entries.

In [9]:
df['SQ_FT']=pd.to_numeric(df['SQ_FT'],errors='coerce')
# Calculate the mean of the "SQ_FT" column
mean_sq_ft = df['SQ_FT'].mean()

# Replace NaN (empty) values in "SQ_FT" with the mean
df["SQ_FT"].fillna(mean_sq_ft, inplace=True)

# 8.What is the sum of SQ_FT of all entries in the dataset.

In [10]:
# Calculate the sum of SQ_FT for all entries in the dataset
sum_sq_ft = df["SQ_FT"].sum()

# Display the sum
print("Sum of SQ_FT:", sum_sq_ft)

Sum of SQ_FT: 8470.0

# 9.Add a new column “NUM_STORE” and with all the values as 1 for all rows

In [11]:
# Add a new column "NUM_STORE" with all values set to 1
df['NUM_STORE'] = 1

# 10.Create a DataFrame containing all entries of TN state only

In [12]:
# Create a DataFrame containing all entries with the "TN" state
tn_df = df[df["STATE"] == "TN"]

# 11.Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame

In [13]:
# Create a DataFrame with "SQ_FT" area greater than 1000
sq_ft_greater_than_1000 = df[df["SQ_FT"] > 1000]

# Display the resulting DataFrame
print(sq_ft_greater_than_1000)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT  \
1  100002000.0  MAHARASHTRA      21325            3      1.5  1210.0
3          NaN           TN  589465645            3        2  1600.0
5  100008000.0           HP      23131            1        1  1210.0
6  100009000.0           HP      21212           na        2  1800.0

   NUM_STORE
1          1
3          1
5          1
6          1

# 12. Create a DataFrame having only first Three columns and First Three rows

In [14]:
# Create a new DataFrame with the first three columns and first three rows
subset_df = df.iloc[:3, :3]

# Display the resulting DataFrame
print(subset_df)

           PID        STATE   PRICE
0  100001000.0           MP  321654
1  100002000.0  MAHARASHTRA   21325
2  100004000.0           TN  321321

# 13.Display the state having highest average price per square foot of housing area. Hint: Average of (TotalPrice/Sq_Ft)

In [15]:
# Calculate the average price per square foot for each state
df['Price_Per_Sq_Ft'] = df['PRICE'] / df['SQ_FT']
average_price_by_state = df.groupby('STATE')['Price_Per_Sq_Ft'].mean()

# Find the state with the highest average price per square foot
state_with_highest_avg_price = average_price_by_state.idxmax()

# Display the state with the highest average price per square foot
print("State with the highest average price per square foot:", state_with_highest_avg_price)

State with the highest average price per square foot: TN